### Import your libraries

In [1]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

### Load your dataset

In [2]:
df = pd.read_csv('HR_Missing_Vslues.csv')

### Explore your data 

* First 5 recods
* Last 5 records 
* Check data type
* Show statistical summary 
* Is there any missing values ?
* Applay two more data analysis from your choose

In [3]:
df.head()

,Employee_Name,EmpID,Salary,PositionID,Position,DOB,Sex,MaritalDesc,RaceDesc,DateofHire,DateofTermination,Department,ManagerName,ManagerID,RecruitmentSource,Absences
0,"Adinolfi, Wilson K",10026,62506.0,19,Production Technician I,07/10/83,M,Single,White,7/5/2011,NaN,Production,Michael Albert,22.0,LinkedIn,1.0
1,"Ait Sidi, Karthikeyan",10084,104437.0,27,Sr. DBA,05/05/75,M,Married,White,3/30/2015,6/16/2016,IT/IS,Simon Roup,4.0,Indeed,17.0
2,"Akinkuolie, Sarah",10196,64955.0,20,Production Technician II,09/19/88,F,Married,White,7/5/2011,9/24/2012,Production,Kissy Sullivan,20.0,LinkedIn,3.0
3,"Alagbe,Trina",10088,64991.0,19,Production Technician I,NaN,F,Married,White,1/7/2008,NaN,Production,Elijiah Gray,16.0,Indeed,15.0
4,NaN,10069,50825.0,19,Production Technician I,09/08/89,F,Divorced,White,7/11/2011,9/6/2016,Production,Webster Butler,39.0,Google Search,2.0

In [4]:
df.tail()

,Employee_Name,EmpID,Salary,PositionID,Position,DOB,Sex,MaritalDesc,RaceDesc,DateofHire,DateofTermination,Department,ManagerName,ManagerID,RecruitmentSource,Absences
306,"Woodson, Jason",10135,65893.0,20,Production Technician II,05/11/85,M,Single,White,7/7/2014,NaN,Production,Kissy Sullivan,20.0,LinkedIn,13.0
307,"Ybarra, Catherine",10301,48513.0,19,Production Technician I,NaN,F,Single,Asian,9/2/2008,9/29/2015,Production,Brannon Miller,12.0,Google Search,4.0
308,NaN,10010,220450.0,6,CIO,NaN,F,Single,White,4/10/2010,NaN,IT/IS,Janet King,2.0,Employee Referral,16.0
309,"Zhou, Julia",10043,89292.0,9,Data Analyst,02/24/79,F,Single,White,3/30/2015,NaN,IT/IS,Simon Roup,4.0,Employee Referral,NaN
310,NaN,10271,45046.0,19,Production Technician I,08/17/78,F,Widowed,Asian,9/29/2014,NaN,Production,David Stanley,14.0,LinkedIn,2.0

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 311 entries, 0 to 310
Data columns (total 16 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Employee_Name      218 non-null    object
 1   EmpID              311 non-null    int64
 2   Salary             249 non-null    float64
 3   PositionID         311 non-null    int64
 4   Position           311 non-null    object
 5   DOB                280 non-null    object
 6   Sex                249 non-null    object
 7   MaritalDesc        311 non-null    object
 8   RaceDesc           311 non-null    object
 9   DateofHire         311 non-null    object
 10  DateofTermination  104 non-null    object
 11  Department         311 non-null    object
 12  ManagerName        311 non-null    object
 13  ManagerID          303 non-null    float64
 14  RecruitmentSource  311 non-null    object
 15  Absences           280 non-null    float64
dtypes: float64(3), int64(2), object(11)
memory usage: 39.0+ KB

In [6]:
df.isna().sum()

Employee_Name         93
EmpID                  0
Salary                62
PositionID             0
Position               0
DOB                   31
Sex                   62
MaritalDesc            0
RaceDesc               0
DateofHire             0
DateofTermination    207
Department             0
ManagerName            0
ManagerID              8
RecruitmentSource      0
Absences              31
dtype: int64

In [7]:
df['Salary'].max()

220450.0

In [8]:
df.shape

(311, 16)

In [9]:
df.describe().round()

         EmpID    Salary  PositionID  ManagerID  Absences
count    311.0     249.0       311.0      303.0     280.0
mean   10156.0   67973.0        17.0       15.0      10.0
std       90.0   22996.0         6.0        8.0       6.0
min    10001.0   45046.0         1.0        1.0       1.0
25%    10078.0   55315.0        18.0       10.0       5.0
50%    10156.0   62957.0        19.0       15.0      10.0
75%    10234.0   71707.0        20.0       19.0      15.0
max    10311.0  220450.0        30.0       39.0      20.0

### Do the following steps for each column with missing values.

* Identity the column 
* How much precentage the missing value represents 
* What is the best way to handle these missing values and why
* Apply your method to the column

In [10]:
df.columns

Index(['Employee_Name', 'EmpID', 'Salary', 'PositionID', 'Position', 'DOB',
       'Sex', 'MaritalDesc', 'RaceDesc', 'DateofHire', 'DateofTermination',
       'Department', 'ManagerName', 'ManagerID', 'RecruitmentSource',
       'Absences'],
      dtype='object')

In [11]:
percent_missing = df.isnull().sum() * 100 / len(df)
percent_missing.round()

Employee_Name        30.0
EmpID                 0.0
Salary               20.0
PositionID            0.0
Position              0.0
DOB                  10.0
Sex                  20.0
MaritalDesc           0.0
RaceDesc              0.0
DateofHire            0.0
DateofTermination    67.0
Department            0.0
ManagerName           0.0
ManagerID             3.0
RecruitmentSource     0.0
Absences             10.0
dtype: float64


# Drop the Column
___
### Only in one case, if the column contains mostly empty values, is the column dropped because trying to fill every null value in that column will result in bias.

In [12]:
df.drop(columns=['DateofTermination'],inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 311 entries, 0 to 310
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Employee_Name      218 non-null    object
 1   EmpID              311 non-null    int64
 2   Salary             249 non-null    float64
 3   PositionID         311 non-null    int64
 4   Position           311 non-null    object
 5   DOB                280 non-null    object
 6   Sex                249 non-null    object
 7   MaritalDesc        311 non-null    object
 8   RaceDesc           311 non-null    object
 9   DateofHire         311 non-null    object
 10  Department         311 non-null    object
 11  ManagerName        311 non-null    object
 12  ManagerID          303 non-null    float64
 13  RecruitmentSource  311 non-null    object
 14  Absences           280 non-null    float64
dtypes: float64(3), int64(2), object(10)
memory usage: 36.6+ KB

# Mean
___
### The mean method is useful for unordinl cloumns like : Salary, Absences

___
# Filling the Salary Using mean for each Position

In [13]:
posi=[]
c=df.copy()

#Fill the list with all Position name in the list posi
for i in range(len(df['Position'].value_counts().index)):
    posi.append(df['Position'].value_counts().index[i])

df1=pd.DataFrame()
# Take the mean 
for i in range(len(posi)):
    Poss=df[df['Position']==posi[i]]
    #print(Poss['Salary'].mean())
    Poss['Salary'].fillna(Poss['Salary'].mean(),inplace=True)
    df1=pd.concat([df1,Poss])
df1.head()

,Employee_Name,EmpID,Salary,PositionID,Position,DOB,Sex,MaritalDesc,RaceDesc,DateofHire,Department,ManagerName,ManagerID,RecruitmentSource,Absences
0,"Adinolfi, Wilson K",10026,62506.0,19,Production Technician I,07/10/83,M,Single,White,7/5/2011,Production,Michael Albert,22.0,LinkedIn,1.0
3,"Alagbe,Trina",10088,64991.0,19,Production Technician I,NaN,F,Married,White,1/7/2008,Production,Elijiah Gray,16.0,Indeed,15.0
4,NaN,10069,50825.0,19,Production Technician I,09/08/89,F,Divorced,White,7/11/2011,Production,Webster Butler,39.0,Google Search,2.0
5,NaN,10002,57568.0,19,Production Technician I,05/22/77,F,Single,White,1/9/2012,Production,Amy Dunn,11.0,LinkedIn,15.0
7,"Athwal, Sam",10062,59365.0,19,Production Technician I,02/18/83,M,Widowed,White,9/30/2013,Production,Ketsia Liebig,19.0,Employee Referral,19.0

___
# Filling the Absences Using median

In [14]:
df1['Absences'].fillna(df1['Absences'].median(),inplace=True)

# Deleting row
___
### if most of the values are empty, deleting the row is the most valuable choice to choose

In [15]:
df1.dropna(subset=['Salary'],axis=0,inplace=True)
df1.isna().sum()

Employee_Name        91
EmpID                 0
Salary                0
PositionID            0
Position              0
DOB                  29
Sex                  62
MaritalDesc           0
RaceDesc              0
DateofHire            0
Department            0
ManagerName           0
ManagerID             8
RecruitmentSource     0
Absences              0
dtype: int64

___

In [16]:
df1.isna().sum()

Employee_Name        91
EmpID                 0
Salary                0
PositionID            0
Position              0
DOB                  29
Sex                  62
MaritalDesc           0
RaceDesc              0
DateofHire            0
Department            0
ManagerName           0
ManagerID             8
RecruitmentSource     0
Absences              0
dtype: int64

# Fill the Data With Unknown 
---
### Filling the null values with the value (unknown) is suitable for values that do not have a direct effect, such as: date of birth

In [17]:
df1['DOB'].fillna('Unknown',inplace=True)
df1.isna().sum()

Employee_Name        91
EmpID                 0
Salary                0
PositionID            0
Position              0
DOB                   0
Sex                  62
MaritalDesc           0
RaceDesc              0
DateofHire            0
Department            0
ManagerName           0
ManagerID             8
RecruitmentSource     0
Absences              0
dtype: int64

___
# Has no name and sex mentioned 
#### Their information will be dropped immediately

In [18]:
df1.dropna(subset=['Employee_Name','Sex'],how='all',inplace=True)
df1

,Employee_Name,EmpID,Salary,PositionID,Position,DOB,Sex,MaritalDesc,RaceDesc,DateofHire,Department,ManagerName,ManagerID,RecruitmentSource,Absences
0,"Adinolfi, Wilson K",10026,62506.0,19,Production Technician I,07/10/83,M,Single,White,7/5/2011,Production,Michael Albert,22.0,LinkedIn,1.0
3,"Alagbe,Trina",10088,64991.0,19,Production Technician I,Unknown,F,Married,White,1/7/2008,Production,Elijiah Gray,16.0,Indeed,15.0
4,NaN,10069,50825.0,19,Production Technician I,09/08/89,F,Divorced,White,7/11/2011,Production,Webster Butler,39.0,Google Search,2.0
5,NaN,10002,57568.0,19,Production Technician I,05/22/77,F,Single,White,1/9/2012,Production,Amy Dunn,11.0,LinkedIn,15.0
7,"Athwal, Sam",10062,59365.0,19,Production Technician I,02/18/83,M,Widowed,White,9/30/2013,Production,Ketsia Liebig,19.0,Employee Referral,19.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
131,"Houlihan, Debra",10272,180000.0,11,Director of Sales,03/17/66,NaN,Married,White,5/5/2014,Sales,Janet King,2.0,LinkedIn,19.0
96,NaN,10015,178000.0,12,IT Director,Unknown,M,Single,Black or African American,4/15/2011,IT/IS,Jennifer Zamora,5.0,Indeed,15.0
76,NaN,10028,138888.0,13,IT Manager - Support,07/09/70,M,Single,Black or African American,1/5/2014,IT/IS,Jennifer Zamora,5.0,Indeed,4.0
35,"Cady, Max",10150,77692.0,25,Software Engineering Manager,11/22/66,M,Single,White,8/15/2011,Software Engineering,Jennifer Zamora,5.0,Google Search,4.0
308,NaN,10010,220450.0,6,CIO,Unknown,F,Single,White,4/10/2010,IT/IS,Janet King,2.0,Employee Referral,16.0

In [19]:
per=df1.isna().sum()*100/len(df1)
per

Employee_Name        25.000000
EmpID                 0.000000
Salary                0.000000
PositionID            0.000000
Position              0.000000
DOB                   0.000000
Sex                  14.788732
MaritalDesc           0.000000
RaceDesc              0.000000
DateofHire            0.000000
Department            0.000000
ManagerName           0.000000
ManagerID             2.816901
RecruitmentSource     0.000000
Absences              0.000000
dtype: float64

___
# Drop the ManagerID 
___
### The number of null values is not large, so it will not be affected if they are dropped

In [20]:
df1.dropna(subset=['ManagerID'],axis=0,inplace=True)
df1.isna().sum()

Employee_Name        69
EmpID                 0
Salary                0
PositionID            0
Position              0
DOB                   0
Sex                  41
MaritalDesc           0
RaceDesc              0
DateofHire            0
Department            0
ManagerName           0
ManagerID             0
RecruitmentSource     0
Absences              0
dtype: int64

In [22]:
df1.dropna(subset=['Employee_Name','Sex'],how='any',inplace=True)
df1.isna().sum()

Employee_Name        0
EmpID                0
Salary               0
PositionID           0
Position             0
DOB                  0
Sex                  0
MaritalDesc          0
RaceDesc             0
DateofHire           0
Department           0
ManagerName          0
ManagerID            0
RecruitmentSource    0
Absences             0
dtype: int64